August
CD
DVD
December
February
Friday
I
Internet
January
July
June
March
May
Monday
Mr
Mrs
Ms
November
OK
October
Saturday
September
Sunday
TV
Thursday
Tuesday
Wednesday
a
a.m.
abandon
abandoned
ability
able
abolish
abortion
about
above
abroad
absence
absent
absolute
absolutely
absorb
abstract
absurd
abundance
abuse
academic
academy
accelerate
accent
accept
acceptable
acceptance
access
accessible
accident
accidental
accidentally
accommodate
accommodation
accompany
accomplish
accomplishment
accordance
according
accordingly
account
accountability
accountable
accountant
accounting
accumulate
accumulation
accuracy
accurate
accurately
accusation
accuse
accused
achieve
achievement
acid
acknowledge
acquire
acquisition
acre
across
act
action
activate
activation
active
actively
activist
activity
actor
actress
actual
actually
acute
ad
adapt
adaptation
add
addiction
addition
additional
additionally
address
adequate
adequately
adhere
adjacent
adjust
adjustment
administer
administrative
administrator
admiration
admire
admission
admit
adolescent
adopt
adoption
adult
advance
advanced
advantage
adventure
adverse
advert
advertise
advertisement
advertising
advice
advise
advocate
aesthetic
affair
affect
affection
afford
affordable
afraid
after
aftermath
afternoon
afterwards
again
against
age
aged
agency
agent
aggression
aggressive
ago
agree
agreement
agricultural
agriculture
ahead
aid
aide
aids
aim
air
aircraft
airport
alarm
alarmed
alarming
albeit
alcohol
alcoholic
alert
alien
align
alignment
alike
alive
all
allegation
allege
allegedly
alliance
allied
allocate
allocation
allow
allowance
ally
almost
alone
along
alongside
aloud
alphabet
alphabetical
alphabetically
already
also
alter
alternative
alternatively
although
altogether
aluminium
always
amateur
amaze
amazed
amazing
ambassador
ambition
ambulance
amend
amendment
amid
among
amount
amuse
amused
amusing
analogy
analyse
analysis
analyst
ancestor
anchor
ancient
and
angel
anger
angle
angrily
angry
animal
animation
ankle
anniversary
announce
annoy
annoyed
annoying
annual
annually
anonymous
another
answer
anti-
anticipate
anxiety
anxious
anxiously
any
anybody
anyone
anything
anyway
anywhere
apart
apartment
apologize
apology
apparatus
apparent
apparently
appeal
appealing
appear
appearance
appetite
applaud
apple
applicable
applicant
application
apply
appoint
appointment
appreciate
appreciation
approach
appropriate
appropriately
approval
approve
approving
approximate
approximately
arbitrary
architectural
archive
area
arena
arguably
argue
argument
arise
arm
armed
arms
army
around
arrange
arrangement
array
arrest
arrival
arrive
arrow
art
article
articulate
artificial
artificially
artist
artistic
artistically
artwork
as
ash
ashamed
aside
ask
asleep
aspect
aspiration
aspire
assassination
assault
assemble
assembly
assert
assertion
asset
assign
assist
assistance
assistant
associate
associated
association
assume
assumption
assurance
assure
astonishing
asylum
at
atmosphere
atom
atrocity
attach
attached
attachment
attack
attain
attempt
attempted
attend
attendance
attention
attitude
attorney
attract
attraction
attractive
attribute
auction
audience
audio
audit
aunt
authentic
author
authority
authorize
auto
automatic
automatically
autonomy
autumn
availability
available
average
avoid
await
awake
award
aware
awareness
away
away/off
awful
awfully
awkward
awkwardly
baby
bachelor
bachelors
back
backdrop
background
backing
backup
backward
backwards
bacteria
bad
bad-tempered
badge
badly
bag
baggage
bail
bake
balance
balanced
ball
ballet
balloon
ballot
ban
band
bandage
bank
banner
bar
bare
barely
bargain
barrel
barrier
base
based
basement
basic
basically
basis
basket
bass
bat
bath
bathroom
battery
battle
battlefield
bay
be
beach
beak
beam
bear
beard
beast
beat
beautiful
beautifully
beauty
because
become
bed
bedroom
beef
beer
before
begin
beginning
behalf
behave
behaviour
behind
belief
believe
bell
belong
beloved
below
belt
bench
benchmark
bend
beneath
beneficial
beneficiary
benefit
bent
beside
besides
best
bet
betray
better
betting
between
beyond
bias
bicycle
bid
big
bike
bill
billion
bin
bind
biography
biological
biology
bird
birth
birthday
biscuit
bishop
bit
bite
bitter
bitterly
bizarre
black
blade
blame
blank
blanket
blast
bleed
blend
bless
blessing
blind
block
blonde
blood
blow
blue
boar
board
boast
boat
body
boil
bold
bomb
bombing
bone
bonus
book
booking
boom
boost
boot
border
bore
bored
boring
born
borrow
boss
both
bother
bottle
bottom
bounce
bound
boundary
bow
bowl
box
boy
boyfriend
boys
brain
branch
brand
brave
breach
bread
break
breakdown
breakfast
breakthrough
breast
breath
breathe
breathing
breed
brick
bridge
brief
briefly
bright
brightly
brilliant
bring
broad
broadband
broadcast
broadcaster
broadly
broken
brother
brothers
brown
browser
brush
brutal
bubble
buck
buddy
budget
buffer
bug
build
building
bulk
bullet
bunch
burden
bureaucracy
burial
burn
burnt
burst
bury
bus
bush
business
businessman
busy
but
butter
button
buy
buyer
by
bye
cabin
cabinet
cable
cake
calculate
calculation
call
called
calm
calmly
camera
camp
campaign
camping
can
canal
cancel
cancer
candidate
candle
candy
cannot
canvas
cap
capability
capable
capacity
capital
capitalism
capitalist
captain
capture
car
carbon
card
cardboard
care
career
careful
carefully
careless
carelessly
cargo
carpet
carriage
carrot
carry
carve
case
cash
casino
cast
castle
casual
casualty
cat
catalogue
catch
category
cater
cattle
cause
caution
cautious
cave
cease
ceiling
celebrate
celebration
cell
cemetery
cent
centimetre
central
centre
century
ceremony
certain
certainly
certainty
certificate
chain
chair
chairman
chairwoman
challenge
challenging
chamber
championship
chance
change
channel
chaos
chapter
character
characteristic
characterize
charge
charity
charm
charming
chart
charter
chase
chat
cheap
cheaply
cheat
check
cheek
cheer
cheerful
cheerfully
cheese
chemical
chemist
chemistry
cheque
chest
chew
chicken
chief
child
children
chin
chip
chocolate
choice
choir
choose
chop
chronic
chunk
church
cigarette
cinema
circle
circuit
circulate
circulation
circumstance
citizen
citizenship
city
civic
civil
civilian
civilization
claim
clap
clarify
clarity
clash
class
classic
classification
classify
classroom
clean
cleaning
clear
clearly
clerk
clever
click
client
cliff
climate
climb
climbing
cling
clinic
clinical
clip
clock
close
closed
closely
closet
closure
cloth
clothes
clothing
cloud
club
cluster
coach
coal
coalition
coast
coastal
coat
cocktail
code
coffee
cognitive
coin
coincide
coincidence
cold
coldly
collaborate
collaboration
collapse
colleague
collect
collection
collective
collector
college
collision
colonial
colony
colour
coloured
colourful
colt
column
columnist
combat
combination
combine
come
comedy
comfort
comfortable
comfortably
comic
command
commander
commence
comment
commentary
commentator
commerce
commercial
commission
commissioner
commit
commitment
committee
commodity
common
commonly
communicate
communication
communist
community
companion
company
comparable
comparative
compare
comparison
compassion
compel
compelling
compensate
compensation
compete
competence
competent
competition
competitive
compile
complain
complaint
complement
complete
completely
completion
complex
complexity
compliance
complicate
complicated
complication
comply
compose
composer
composition
compound
comprehensive
comprise
compromise
compulsory
compute
computer
conceal
concede
conceive
concentrate
concentration
concept
conception
concern
concerned
concerning
concert
concession
conclude
conclusion
concrete
condemn
condition
conduct
confer
conference
confess
confession
confidence
confident
confidently
configuration
confine
confined
confirm
confirmation
conflict
confront
confrontation
confuse
confused
confusing
confusion
congratulate
congratulation
congregation
congress
congressional
connect
connected
connection
conquer
conscience
conscious
consciousness
consecutive
consensus
consent
consequence
consequently
conservation
conservative
conserve
consider
considerable
considerably
consideration
consist
consistency
consistently
consolidate
conspiracy
constant
constantly
constituency
constitute
constitution
constitutional
constraint
construct
construction
consult
consultant
consultation
consumer
consumption
contact
contain
container
contemplate
contemporary
contempt
contend
contender
content
contention
contest
context
continent
continually
continue
continuous
continuously
contract
contractor
contradiction
contrary
contrast
contrasting
contribute
contribution
contributor
control
controlled
controversial
controversy
convenience
convenient
convention
conventional
conversation
conversion
convert
convey
convict
conviction
convince
convincing
cook
cooker
cookie
cooking
cool
cooperate
cooperative
coordinate
coordination
coordinator
cop
cope
copper
copy
copyright
core
corner
corporation
correct
correction
correctly
correlate
correlation
correspond
correspondence
correspondent
corresponding
corridor
corrupt
corruption
cost
costly
cottage
cotton
cough
coughing
could
council
councillor
counselling
counsellor
count
counter
counterpart
countless
country
countryside
county
coup
couple
courage
course
court
courtesy
cousin
cover
coverage
covered
covering
cow
crack
cracked
craft
crash
crawl
crazy
cream
create
creativity
creator
creature
credibility
credible
credit
creep
crime
criminal
crisis
crisp
criterion
critical
critically
criticism
criticize
critique
crop
cross
crowd
crowded
crown
crucial
crude
cruel
cruise
crush
cry
crystal
cue
cult
cultivate
cultural
culture
cup
cupboard
curb
cure
curiosity
curious
curiously
curl
curly
current
currently
curriculum
curtain
curve
curved
custody
custom
customer
customs
cut
cute
cutting
cycle
cycling
cynical
dad
daily
dairy
dam
damage
damaging
damp
dance
dancer
dancing
danger
dangerous
dare
dark
darkness
data
database
date
daughter
daughters
dawn
day
dead
deadline
deadly
deaf
deal
dealer
dear
death
debate
debris
debt
debut
decade
decay
decide
decision
decision-making
decisive
deck
declaration
declare
decline
decorate
decoration
decorative
decrease
dedicated
dedication
deed
deem
deep
deeply
default
defeat
defect
defence
defend
defender
defensive
deficiency
deficit
define
definite
definitely
definition
defy
degree
delay
delegate
delegation
delete
deliberate
deliberately
delicate
delight
delighted
deliver
delivery
demand
democracy
democratic
demon
demonstrate
demonstration
denial
denounce
dense
density
dentist
deny
depart
department
departure
depend
dependence
dependent
depict
deploy
deployment
deposit
depress
depressed
depressing
depression
deprive
depth
deputy
derive
descend
descent
describe
description
desert
deserted
deserve
design
designate
desirable
desire
desk
desktop
desperate
desperately
despite
destroy
destruction
destructive
detail
detailed
detain
detection
detention
deteriorate
determinant
determination
determine
determined
devastate
develop
development
device
devil
devise
devote
devoted
diagnose
diagnosis
diagram
diamond
diary
dictate
dictator
dictionary
die
diet
differ
difference
different
differentiate
differently
difficult
difficulty
dig
digital
dignity
dilemma
dimension
diminish
dinner
dip
diplomat
diplomatic
direct
direction
directly
director
directory
dirt
dirty
disability
disabled
disadvantage
disagree
disagreement
disappear
disappoint
disappointed
disappointing
disappointment
disapproval
disapprove
disapproving
disaster
disastrous
disc
discard
discharge
discipline
disclose
disclosure
discount
discourage
discourse
discover
discovery
discretion
discrimination
discuss
discussion
disease
disgust
disgusted
disgusting
dish
dishonest
dishonestly
disk
dislike
dismiss
dismissal
disorder
displace
display
disposal
dispose
dispute
disrupt
disruption
dissolve
distance
distant
distinct
distinction
distinctive
distinguish
distort
distract
distress
distribute
distribution
district
disturb
disturbing
dive
diverse
diversity
divert
divide
divine
division
divorce
divorced
do
doctor
doctrine
document
documentation
dog
doing
dollar
domain
domestic
dominance
dominant
dominate
donation
donor
door
dose
dot
double
doubt
down
downstairs
downtown
downward
downwards
dozen
draft
drag
drain
drama
dramatic
dramatically
draw
drawer
drawing
dream
dress
dressed
drift
drink
drive
driver
driving
drop
drought
drown
drug
drugstore
drum
drunk
dry
dual
dub
duck
duckling
due
dull
dumb
dump
duo
duration
during
dust
duty
dying
dynamic
e.g.
each
eager
ear
early
earn
earnings
earth
ease
easily
east
eastern
easy
eat
echo
ecological
economic
economics
economist
economy
edge
edition
editor
editorial
educate
educated
education
educator
effect
effective
effectively
effectiveness
efficiency
efficient
efficiently
effort
egg
ego
eight
eighteen
eighteenth
eighth
eightieth
eighty
either
elaborate
elbow
elderly
elect
election
electoral
electric
electrical
electricity
electronic
electronics
elegant
element
elementary
elevate
elevator
eleven
eleventh
eligible
eliminate
elite
else
elsewhere
email
embark
embarrass
embarrassed
embarrassing
embarrassment
embassy
embed
embody
embrace
emerge
emergence
emergency
emission
emotion
emotional
emotionally
emphasis
emphasize
empire
empirical
employ
employee
employer
employment
empower
empty
enable
enact
encompass
encounter
encourage
encouragement
encouraging
end
endeavour
ending
endless
endorse
endorsement
endure
enemy
energy
enforce
enforcement
engage
engaged
engagement
engaging
engine
engineer
engineering
enjoy
enjoyable
enjoyment
enormous
enough
enquire
enquiry
enrich
enrol
ensue
ensure
enter
enterprise
entertain
entertainer
entertaining
entertainment
enthusiasm
enthusiast
enthusiastic
enthusiastically
entire
entirely
entitle
entity
entrance
entrepreneur
entry
envelope
environment
environmental
epidemic
equal
equality
equally
equation
equip
equipment
equivalent
era
erect
error
erupt
escalate
escape
especially
essay
essence
essential
essentially
establish
establishment
estate
estimate
etc.
eternal
ethic
ethnic
euro
evacuate
evaluation
even
evening
event
eventually
ever
every
everybody
everyone
everything
everywhere
evidence
evident
evil
evoke
evolution
evolutionary
evolve
ex-
exact
exactly
exaggerate
exaggerated
exam
examination
examine
example
exceed
excellence
excellent
except
exception
exceptional
excess
excessive
exchange
excite
excited
excitement
exciting
exclude
excluding
exclusion
exclusive
exclusively
excuse
execute
execution
executive
exercise
exert
exhibit
exhibition
exile
exist
existence
exit
exotic
expand
expansion
expect
expectation
expected
expenditure
expense
expensive
experience
experienced
experiment
experimental
expert
expertise
expire
explain
explanation
explicit
explicitly
explode
exploit
exploitation
explore
explosion
explosive
export
expose
exposure
express
expression
extend
extension
extensive
extensively
extent
extra
extract
extraordinary
extreme
extremely
extremist
eye
fabric
fabulous
face
facilitate
facility
fact
faction
factor
factory
faculty
fade
fail
failed
failure
faint
faintly
fair
fairly
fairness
faith
faithful
faithfully
fake
fall
false
fame
familiar
family
famous
fan
fancy
fantasy
far
fare
farm
farmer
farming
farther
farthest
fashion
fashionable
fast
fasten
fat
fatal
fate
father
faucet
fault
favour
favourable
favourite
fear
feat
feather
feature
federal
fee
feed
feeding
feel
feeling
fellow
female
feminist
fence
festival
fetch
fever
few
fibre
field
fierce
fifteen
fifteenth
fifth
fiftieth
fifty
fight
fighting
figure
file
fill
film
film-maker
filter
final
finally
finance
financial
find
fine
finely
finger
finish
finished
fire
firearm
firefighter
firework
firm
firmly
first
fish
fishing
fit
five
fix
fixed
fixture
flag
flame
flash
flat
flavour
flaw
flawed
flee
fleet
flesh
flexibility
flight
float
flood
flooded
flooding
floor
flour
flourish
flow
flower
flu
fluid
fly
flying
focus
fold
folding
follow
following
fond
food
fool
foot
footage
football
for
forbid
force
forecast
foreign
foreigner
forest
forever
forge
forget
forgive
fork
form
formal
formally
format
formation
former
formerly
formula
formulate
forth
forthcoming
fortieth
fortunate
fortune
forty
forum
forward
fossil
foster
found
foundation
founder
four
fourteen
fourteenth
fourth
fraction
fragile
fragment
frame
framework
franchise
frankly
fraud
free
freedom
freely
freeze
frequent
frequently
fresh
freshly
fridge
friend
friendly
friendship
frighten
frightened
frightening
from
front
frozen
fruit
frustrated
frustrating
frustration
fry
fuel
fulfil
full
full-time
fully
fun
function
functional
fund
fundamental
fundamentally
fundraising
funeral
funny
fur
furious
furniture
further
future
gain
gallon
gamble
gambling
game
gaming
gap
garage
garbage
garden
gas
gasoline
gate
gather
gathering
gay
gaze
gear
gender
gene
general
generally
generate
generation
generic
generous
generously
genetic
genius
genocide
gentle
gentleman
gently
genuine
genuinely
geography
gesture
get
giant
gift
gig
girl
girlfriend
girls
give
glad
glance
glass
glimpse
global
globalization
globe
glorious
glory
glove
glue
go
goal
god
gold
golden
good
goodbye
goodness
goods
gorgeous
govern
governance
government
governor
grab
grace
grade
gradual
gradually
grain
gram
grammar
grand
grandchild
granddaughter
grandfather
grandmother
grandparent
grandson
grant
graphic
graphics
grasp
grass
grateful
grave
gravely
gravity
great
greatly
green
greenhouse
grey
grid
grief
grin
grind
grip
grocery
ground
group
grow
growth
guarantee
guard
guerrilla
guess
guest
guidance
guide
guideline
guilt
guilty
gun
gut
guy
habit
habitat
hail
hair
hairdresser
half
halfway
hall
halt
hammer
hand
handful
handle
handling
handy
hang
happen
happily
happiness
happy
harassment
harbour
hard
hardly
hardware
harm
harmful
harmless
harmony
harsh
harvest
hat
hate
hatred
haunt
have
hazard
he
head
headache
headquarters
heal
health
healthcare
healthy
hear
hearing
heart
heat
heating
heaven
heavily
heavy
heel
height
heighten
hell
hello
helmet
help
helpful
hence
her
herb
here
heritage
hero
hers
herself
hesitate
hi
hidden
hide
hierarchy
high
high-profile
highlight
highly
highway
hilarious
hill
him
himself
hint
hip
hire
his
historian
historical
history
hit
hobby
hold
hole
holiday
hollow
holy
home
homeland
homeless
homework
honest
honestly
honesty
honour
hook
hope
hopeful
hopefully
horizon
horizontal
horn
horror
horse
hospital
host
hostage
hostile
hostility
hot
hotel
hour
house
household
housing
how
however
huge
human
humanitarian
humanity
humble
humorous
humour
hundred
hundredth
hunger
hungry
hunt
hunting
hurry
hurt
husband
husbands
hydrogen
hypothesis
i.e.
ice
icon
idea
ideal
identical
identification
identify
identity
ideological
ideology
idiot
if
ignorance
ignore
ill
illegal
illegally
illness
illusion
illustrate
image
imagery
imaginary
imagination
imagine
immediate
immediately
immense
immigration
imminent
immoral
immune
impact
impatient
implement
implementation
implication
imply
import
importance
important
importantly
impose
impossible
impress
impressed
impression
impressive
imprison
imprisonment
improve
improvement
in
inability
inadequate
inappropriate
incentive
inch
incidence
incident
inclined
include
including
inclusion
income
incorporate
incorrect
increase
increasingly
incur
indeed
independence
independent
independently
index
indicate
indication
indicator
indictment
indigenous
indirect
indirectly
individual
indoor
indoors
induce
indulge
industrial
industry
inequality
inevitable
inevitably
infamous
infant
infect
infected
infection
infectious
infer
inflation
inflict
influence
influential
info
inform
informal
information
infrastructure
ingredient
inhabitant
inherent
inherit
inhibit
initial
initially
initiate
initiative
inject
injection
injure
injured
injury
injustice
ink
inmate
inner
innocent
innovation
innovative
input
insect
insert
insertion
inside
insider
insist
inspect
inspection
inspector
inspiration
install
installation
instance
instant
instantly
instead
instinct
institute
institution
institutional
instruct
instruction
instrument
instrumental
insufficient
insult
insulting
insurance
intact
intake
integral
integrate
integrated
integration
integrity
intellectual
intelligence
intelligent
intend
intended
intensify
intensity
intensive
intent
intention
interact
interaction
interactive
interest
interested
interesting
interface
interfere
interference
interim
interior
intermediate
internal
international
interpret
interpretation
interrupt
interruption
interval
intervene
intervention
interview
intimate
into
intriguing
introduce
introduction
invade
invasion
invent
invention
invest
investigate
investigation
investigator
investment
investor
invisible
invitation
invite
invoke
involve
involved
involvement
iron
ironic
ironically
irony
irrationals
irrelevant
irritate
irritated
irritating
island
isolate
isolated
isolation
issue
it
item
its
itself
jacket
jail
jam
jealous
jeans
jelly
jet
jewellery
job
join
joint
jointly
joke
journalism
journalist
journey
joy
judge
judgement
judicial
juice
jump
junction
junior
jurisdiction
jury
just
justice
justification
justified
justify
keen
keep
key
keyboard
kick
kid
kidnap
kidney
kill
killing
kilogram
kilometre
kind
kindly
kindness
king
kingdom
kiss
kit
kitchen
kitten
knee
knife
knit
knitted
knitting
knock
knot
know
knowledge
known
lab
label
laboratory
labour
lack
lacking
lad
ladder
lady
lake
lamp
land
landing
landlord
landmark
landscape
lane
language
lap
large
large-scale
largely
laser
last
late
lately
later
latest
latter
laugh
launch
law
lawn
lawsuit
lawyer
lay
layer
layout
lazy
lead
leader
leading
leaf
leaflet
league
leak
lean
leap
learn
least
leather
leave
lecture
left
leg
legacy
legal
legally
legend
legendary
legislation
legislative
legislature
legitimate
lemon
lend
length
lengthy
lens
lesbian
less
lesser
lesson
let
lethal
letter
level
liable
liberal
liberation
liberty
library
licence
license
lid
lie
life
lifelong
lifetime
lift
light
lighting
lightly
like
likelihood
likely
likewise
limb
limit
limitation
limited
line
line-up
linear
linger
link
lip
liquid
list
listen
listing
literacy
literally
literary
literature
litre
litter
little
live
lively
liver
living
load
loan
lobby
local
locally
locate
located
location
lock
log
logic
logical
logo
lonely
long
long-standing
long-time
look
loom
loop
loose
loosely
lorry
lose
loss
lost
lot
lottery
loud
loudly
love
lovely
lover
low
loyal
loyalty
luck
lucky
luggage
lump
lunch
lung
lyric
machine
machinery
mad
magazine
magic
magical
magistrate
magnetic
magnificent
magnitude
mail
main
mainland
mainly
mainstream
maintain
maintenance
major
majority
make
make-up
making
male
mall
man
manage
management
manager
mandate
mandatory
manifest
manipulate
manipulation
manner
manufacture
manufacturer
manufacturing
manuscript
many
map
marathon
march
mare
margin
marginal
marine
mark
marker
market
marketing
marketplace
marriage
married
marry
martial
mask
mass
massacre
massive
master
match
matching
mate
material
mathematical
mathematics
matrix
matter
mature
maximize
maximum
may
maybe
mayor
me
meal
mean
meaning
meaningful
means
meantime
meanwhile
measure
measurement
meat
mechanic
mechanical
mechanism
medal
media
medical
medication
medicine
medieval
meditation
medium
meet
meeting
melody
melt
member
membership
memo
memoir
memorable
memorial
memory
mental
mentally
mention
mentor
menu
merchant
mercy
mere
merely
merge
merger
merit
mess
message
metal
metaphor
method
methodology
metre
mid-
midday
middle
midnight
midst
might
migration
mild
mile
militant
military
militia
milk
mill
milligram
millimetre
million
millionth
mind
mine
miner
mineral
minimal
minimize
minimum
mining
minister
ministry
minor
minority
minute
miracle
mirror
miserable
misery
misleading
miss
missile
missing
mistake
mistaken
mix
mixed
mixture
mob
mobile
mobility
mobilize
mode
model
moderate
modern
modest
modification
mom
moment
momentum
money
monitor
monk
monopoly
monster
month
monthly
monument
mood
moon
moral
morality
morally
more
moreover
morning
mortgage
mosque
most
mostly
mother
motion
motivate
motivation
motive
motor
motorbike
motorcycle
motorist
mount
mountain
mouse
mouth
move
movement
movie
moving
much
mud
multiply
mum
municipal
murder
muscle
museum
music
musical
musician
must
mutual
my
myself
mysterious
mystery
myth
nail
naked
name
namely
narrow
nasty
nation
national
nationwide
natural
naturally
nature
naval
navigation
navy
near
nearby
nearly
neat
neatly
necessarily
necessary
necessity
neck
need
needle
negative
neglect
negotiate
negotiation
neighbour
neighbourhood
neighbouring
neither
nephew
nerve
nervous
nervously
nest
net
network
neutral
never
nevertheless
new
newly
news
newsletter
newspaper
next
nice
nicely
niche
niece
night
nine
nineteen
nineteenth
ninetieth
ninety
ninth
no
noble
nobody
nod
noise
noisily
noisy
nominate
nomination
nominee
non-
non-profit
none
nonetheless
nonsense
noon
nor
norm
normal
normally
north
northern
nose
not
notable
notably
note
notebook
nothing
notice
noticeable
notify
notorious
novel
novelist
now
nowadays
nowhere
nuclear
number
numbers
nurse
nursery
nursing
nut
nutrition
obesity
obey
object
objection
objective
oblige
observation
observe
observer
obsess
obsession
obstacle
obtain
obvious
obviously
occasion
occasional
occasionally
occupation
occupied
occupy
occur
occurrence
ocean
odd
oddly
odds
of
off
offence
offend
offender
offense
offensive
offer
offering
office
officer
official
officially
offspring
offsprings
often
oh
oil
old
old-fashioned
on
once
one
ongoing
onion
online
only
onto
open
opening
openly
opera
operate
operation
operational
operator
opinion
opponent
opportunity
oppose
opposed
opposing
opposite
opposition
opt
optical
optimism
optimistic
option
or
oral
orange
orchestra
order
ordinary
organ
organic
organization
organizational
organize
organized
orientation
origin
original
originally
originate
other
otherwise
ought
our
ours
ourselves
out
outbreak
outdoor
outdoors
outer
outfit
outing
outlet
outline
outlook
output
outrage
outside
outsider
outstanding
oven
over
overall
overcome
overlook
overly
overnight
overseas
oversee
overturn
overwhelm
overwhelming
owe
own
owner
ownership
oxygen
o’clock
p.m.
pace
pack
package
packaging
packet
pad
page
pain
painful
paint
painter
painting
pair
palace
pale
palm
pan
panel
panic
pants
paper
parade
parallel
parameter
parent
parental
parish
park
parliament
parliamentary
part
part-time
partial
partially
participation
particular
particularly
partly
partner
partnership
party
pass
passage
passenger
passing
passionate
passive
passport
password
past
pastor
patch
patent
path
pathway
patience
patient
patrol
patron
pattern
pause
pay
payment
peace
peaceful
peak
peasant
peculiar
peer
pen
penalty
pencil
penny
pension
people
pepper
per
perceive
perception
perfect
perfectly
perform
performance
performer
perhaps
period
permanent
permanently
permission
permit
persist
persistent
person
personal
personality
personally
personnel
persuade
pet
petition
petrol
phase
philosopher
philosophical
philosophy
phone
photo
photocopy
photograph
photographer
photography
phrase
physical
physically
physician
physics
piano
pick
picture
piece
pig
pile
pill
pilot
pin
pink
pint
pioneer
pipe
pipeline
pirate
pit
pitch
pity
place
placement
plain
plan
plane
planet
planning
plant
plastic
plate
platform
play
player
plea
plead
pleasant
pleasantly
please
pleased
pleasing
pleasure
pledge
plenty
plot
plug
plunge
plus
pocket
poem
poetry
point
pointed
poison
poisonous
pole
police
policy
polish
polite
politely
political
politically
politician
politics
poll
pollution
pond
pool
poor
pop
popular
population
port
portfolio
portion
portray
pose
position
positive
possess
possession
possibility
possible
possibly
post
post-war
postpone
pot
potato
potential
potentially
pound
pour
powder
power
powerful
powerset
practical
practically
practice
practise
practitioner
praise
pray
prayer
preach
precede
precedent
precious
precise
precisely
precision
predator
predecessor
predict
predictable
predominantly
prefer
preference
pregnancy
pregnant
prejudice
preliminary
premier
premise
premises
premium
preparation
prepare
prepared
prescribe
prescription
presence
present
presentation
presently
preservation
preserve
preside
presidency
president
presidential
press
pressure
prestigious
presumably
presume
pretend
pretty
prevail
prevalence
prevent
prevention
previous
previously
prey
price
pride
priest
primarily
primary
prime
prince
princess
principal
principle
print
printer
printing
prior
priority
prison
prisoner
private
privately
privatization
privilege
prize
probability
probable
probably
probe
problem
problematic
procedure
proceed
proceeding
proceeds
process
processing
processor
proclaim
produce
producer
product
production
productive
productivity
profession
professional
professor
profit
profitable
profound
program
programme
programming
progress
progressive
prohibit
project
projection
prominent
promise
promising
promote
promotion
prompt
promptly
pronounce
pronounced
pronunciation
proof
propaganda
proper
properly
property
proportion
proposal
propose
proposition
prosecute
prosecution
prosecutor
prospect
prospective
prosperity
protect
protection
protective
protein
protest
protester
protocol
proud
proudly
prove
provide
provided
providing
province
provincial
provision
provoke
psychiatric
psychological
pub
public
publication
publicity
publicly
publish
publishing
pull
pulse
pump
punch
punish
punishment
punk
pupil
puppy
purchase
pure
purely
purple
purpose
pursue
pursuit
push
put
puzzle
qualification
qualified
qualify
quality
quantity
quarter
queen
query
quest
question
questionnaire
quick
quickly
quiet
quietly
quit
quite
quota
quote
race
racial
racing
racism
racist
radar
radiation
radical
radio
rage
raid
rail
railroad
railway
rain
raise
rally
random
range
rank
ranking
rape
rapid
rapidly
rare
rarely
rat
rate
rather
rating
ratio
rational
rationals
raw
ray
re-
reach
react
reaction
read
reader
readily
reading
ready
real
realistic
reality
realization
realize
really
realm
rear
reason
reasonable
reasonably
reasoning
reassure
rebel
rebellion
rebuild
recall
receipt
receive
receiver
recent
recently
reception
recession
recipient
reckon
recognition
recognize
recommend
reconstruction
record
recording
recount
recover
recovery
recruit
recruitment
rectangular
red
reduce
reduction
refer
referee
reference
referendum
reflect
reflection
reform
refrigerator
refuge
refugee
refusal
refuse
regain
regard
regarding
regardless
regime
region
regional
register
registration
regret
regular
regularly
regulate
regulation
regulator
regulatory
rehabilitation
reign
reinforce
reject
rejection
relate
related
relation
relationship
relative
relatively
relax
relaxed
relaxing
release
relevance
relevant
reliability
relief
relieve
relieved
religion
religious
reluctant
rely
remain
remainder
remaining
remains
remark
remarkable
remarkably
remedy
remember
remind
reminder
remote
removal
remove
render
renew
renowned
rent
rental
rented
repair
repeat
repeated
repeatedly
replace
replacement
reply
report
reportedly
reporting
represent
representation
representative
reproduce
reproduction
republic
reputation
request
require
requirement
rescue
research
resemble
reservation
reserve
reside
residence
resident
residential
residue
resign
resignation
resist
resistance
resolution
resolve
resort
resource
respect
respective
respectively
respond
response
responsibility
responsible
rest
restaurant
restoration
restore
restraint
restrict
restricted
restriction
result
resume
retail
retain
retire
retired
retirement
retreat
retrieve
return
reveal
revelation
revenge
revenue
reverse
review
revise
revision
revival
revive
revolution
revolutionary
reward
rhetoric
rhythm
rice
rich
rid
ride
rider
ridiculous
riding
rifle
right
rightly
ring
riot
rip
rise
risk
risky
ritual
rival
river
road
rob
robbery
robust
rock
rocket
rod
role
roll
romance
romantic
roof
room
root
rope
rose
rotate
rotation
rough
roughly
round
rounded
route
routine
row
royal
rub
rubber
rubbish
rude
rudely
ruin
ruined
rule
ruler
ruling
rumour
run
runner
running
rural
rush
sack
sacred
sacrifice
sad
sadly
sadness
safe
safely
safety
sail
sailing
sailor
saint
sake
salad
salary
sale
salt
salty
same
sample
sanction
sand
satisfaction
satisfied
satisfy
satisfying
sauce
save
saving
say
scalar
scale
scandal
scare
scared
scattered
scenario
scene
sceptical
schedule
scheme
scholar
scholarship
school
science
scientific
scientist
scissors
scope
score
scratch
scream
screen
screening
screw
scrutiny
sea
seal
search
season
seat
second
secondary
secret
secretary
secretly
section
sector
secular
secure
security
see
seed
seek
seeker
seem
seemingly
segment
seize
seldom
select
selection
selective
self
self-
sell
seminar
senate
senator
send
senior
sensation
sense
sensible
sensitive
sensitivity
sentence
sentiment
separate
separated
separately
separation
serial
series
serious
seriously
servant
serve
service
session
set
set-up
sets
settle
settlement
settler
seven
seventeen
seventh
seventieth
seventy
several
severe
severely
sew
sewing
sex
sexual
sexuality
sexually
sexy
shade
shadow
shake
shall
shallow
shame
shape
shaped
share
shareholder
sharp
sharply
shatter
shave
she
shed
sheep
sheer
sheet
shelf
shell
shelter
shift
shine
shiny
ship
shipping
shirt
shock
shocked
shocking
shoe
shoot
shooting
shop
shopping
shore
short
short-term
shortage
shortly
shot
should
shoulder
shout
show
shower
shrink
shrug
shut
shy
sibling
siblings
sick
side
sideways
sigh
sight
sign
signal
signature
significance
significant
significantly
silence
silent
silk
silly
silver
similar
similarly
simple
simply
simulate
simulation
simultaneously
sin
since
sincere
sincerely
sing
singer
singing
single
sink
sir
sister
sisters
sit
site
situated
situation
six
sixteen
sixth
sixtieth
sixty
size
sketch
skilful
skilfully
skill
skilled
skin
skip
skirt
skull
sky
slam
slap
slash
slavery
sleep
sleeve
slice
slide
slight
slightly
slip
slogan
slope
slot
slow
slowly
small
smart
smash
smell
smile
smoke
smoking
smooth
smoothly
snake
snap
snow
so
so-called
soak
soap
soar
social
socialist
socially
society
sock
soft
softly
software
soil
soldier
sole
solely
solicitor
solid
solidarity
solo
solution
solve
some
somebody
somehow
someone
something
sometime
sometimes
somewhat
somewhere
son
song
soon
sophisticated
sore
sorry
sort
soul
sound
soup
sour
source
south
southern
sovereignty
space
spam
span
spare
spark
speak
speaker
special
specialist
specialize
specialized
specially
specific
specifically
specification
specify
specimen
spectacle
spectacular
spectator
spectrum
speculate
speculation
speech
speed
spell
spelling
spend
sphere
spice
spicy
spider
spill
spin
spine
spirit
spiritual
spite
split
spoil
spoken
spokesman
spokesperson
spokeswoman
sponsorship
spoon
sport
sporting
spot
spotlight
spouse
spouses
spray
spread
spring
spy
squad
square
squeeze
stab
stability
stabilize
stable
staff
stage
stair
stake
stall
stamp
stance
stand
standard
standing
star
stare
stark
start
starve
state
statement
station
statistical
statue
status
stay
steadily
steady
steal
steam
steel
steep
steeply
steer
stem
step
stereotype
stick
sticky
stiff
stiffly
still
stimulate
stimulus
sting
stir
stock
stomach
stone
stop
storage
store
storm
story
stove
straight
straightforward
strain
strand
strange
strangely
stranger
strategic
strategy
stream
street
strength
strengthen
stress
stressed
stretch
strict
strictly
strike
striking
string
strip
stripe
striped
strive
stroke
strong
strongly
structural
structure
struggle
student
studio
study
stuff
stumble
stun
stunning
stupid
style
subject
submission
subscriber
subscription
subsequent
subsequently
subsidy
substance
substantial
substantially
substitute
substitution
subtle
suburb
suburban
succeed
success
successful
successfully
succession
successive
successor
such
suck
sudden
suddenly
sue
suffer
suffering
sufficient
sufficiently
sugar
suggest
suggestion
suicide
suit
suitable
suitcase
suite
suited
sum
summary
summer
summit
sun
super
superb
superior
supermarket
superset
supervise
supervision
supervisor
supplement
supply
support
supporter
supportive
suppose
supposedly
suppress
supreme
sure
surely
surface
surge
surgeon
surgical
surname
surplus
surprise
surprised
surprising
surprisingly
surrender
surround
surrounding
surroundings
surveillance
survey
survival
survive
survivor
suspect
suspend
suspension
suspicion
suspicious
sustain
sustainable
swallow
swear
swearing
sweat
sweater
sweep
sweet
swell
swelling
swim
swimming
swing
switch
swollen
sword
symbol
symbolic
sympathetic
sympathy
syndrome
synthesis
system
systematic
table
tablet
tackle
tactic
tactical
tag
tail
take
talk
tall
tank
tap
tape
target
task
taste
tax
taxi
taxpayer
tea
teach
teacher
teaching
team
tear
technical
technique
technological
technology
teens
telephone
television
tell
temperature
temple
temporarily
temporary
tempt
ten
tenant
tend
tendency
tender
tension
tent
tenth
tenure
term
terminal
terminate
terms
terrain
terrible
terribly
terrific
terrify
territory
terror
terrorism
terrorist
test
testify
testimony
testing
textbook
textman
texture
than
thank
thankfully
thanks
that
the
theater
theatre
theatrical
theft
their
theirs
them
theme
themselves
then
theology
theoretical
theory
therapist
there
thereafter
thereby
therefore
thesis
they
thick
thickly
thickness
thief
thin
thing
think
thinking
third
thirsty
thirteen
thirteenth
thirtieth
thirty
this
thorough
thoroughly
though
thought
thought-provoking
thoughtful
thousand
thousandth
thread
threat
threaten
threatening
three
threshold
thrilled
thrive
throat
through
throughout
throw
thumb
thus
ticket
tide
tidy
tie
tight
tighten
tightly
till
timber
time
timely
timetable
timing
tin
tiny
tip
tire
tired
tiring
tissue
title
to
tobacco
today
toe
together
toilet
tolerance
tolerate
toll
tomato
tomorrow
ton
tone
tongue
tonight
tonne
too
tool
tooth
top
topic
torture
toss
total
totally
touch
tough
tour
tourist
tournament
towards
towel
tower
town
toxic
toy
trace
track
trade
trademark
trading
tradition
traditional
traditionally
traffic
tragedy
tragic
trail
trailer
train
training
trait
transaction
transcript
transfer
transform
transformation
transit
translate
translation
transmission
transmit
transparency
transparent
transport
transportation
trap
trauma
travel
traveller
treasure
treat
treatment
treaty
tree
tremendous
trend
trial
triangle
tribal
tribe
tribunal
tribute
trick
trigger
trillion
trio
trip
triumph
troop
trophy
tropical
trouble
troubled
trousers
truck
true
truly
trust
trustee
truth
try
tsunami
tube
tuition
tune
tunnel
turn
turnout
turnover
twelfth
twelve
twentieth
twenty
twice
twin
twist
twisted
two
type
typical
typically
tyre
ugly
ultimate
ultimately
umbrella
unable
unacceptable
uncertain
uncertainty
uncle
uncomfortable
unconscious
uncontrolled
under
undergo
undergraduate
underground
underlying
undermine
underneath
understand
understanding
undertake
underwater
underwear
undo
undoubtedly
unemployed
unemployment
unexpected
unexpectedly
unfair
unfairly
unfold
unfortunate
unfortunately
unfriendly
unhappy
uniform
unify
unimportant
union
unique
unit
unite
united
unity
universal
universe
university
unkind
unknown
unless
unlike
unlikely
unload
unlucky
unmarried
unnecessary
unpleasant
unprecedented
unreasonable
unsteady
unsuccessful
untidy
until
unusual
unusually
unveil
unwilling
unwillingly
up
upcoming
upgrade
uphold
upon
upper
upset
upsetting
upside
upstairs
upward
upwards
urban
urge
urgent
us
usage
use
used
useful
useless
user
usual
usually
utility
utilize
utterly
vacation
vacuum
vague
valid
validity
valley
valuable
value
van
vanish
variable
variation
varied
variety
various
vary
vast
vegetable
vehicle
vein
venture
verbal
verdict
verify
verse
version
versus
vertical
very
vessel
veteran
via
viable
vibrant
vice
vicious
victim
victory
video
view
viewpoint
village
villager
violate
violation
violence
violent
violently
virtually
virtue
virus
visa
visible
vision
visit
visitor
vital
vocabulary
vocal
voice
volume
voluntary
vote
voting
vow
vulnerability
vulnerable
wage
waist
wait
waiter
wake
walk
walking
wall
wallet
wander
want
war
ward
warehouse
warfare
warm
warming
warmth
warn
warning
warrant
warrior
wash
washing
waste
watch
water
wave
way
we
weak
weaken
weakness
wealth
weapon
wear
weather
weave
web
website
wedding
weed
week
weekend
weekly
weigh
weight
weird
welcome
welfare
well
well-being
west
western
wet
what
whatever
whatsoever
wheat
wheel
when
whenever
where
whereas
whereby
wherever
whether
which
while
whilst
whip
whisper
whistle
white
who
whoever
whole
wholly
whom
whose
why
wide
widely
widen
widespread
widow
width
wife
wild
wildly
will
willing
willingly
willingness
win
wind
window
wine
wing
winner
winning
winter
wipe
wire
wisdom
wise
wish
wit
with
withdraw
withdrawal
within
without
witness
wives
woman
wonder
wonderful
wood
wooden
wool
word
work
worker
workforce
working
workout
workplace
workshop
world
worm
worried
worry
worrying
worse
worship
worst
worth
worthwhile
worthy
would
wound
wounded
wrap
wrapping
wrist
write
writer
writing
written
wrong
wrongly
yard
yawn
yeah
year
yell
yellow
yes
yesterday
yet
yield
you
young
youngster
your
yours
yourself
youth
zero
zone
